tutorials/CFD/22FSI_okk (50-100 with 25modes)/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|  File created by CFD support s.r.o., Wed Jan 25 11:27:58 2017               |
|                    http://www.cdfsupport.com                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pa|pcorr|pcorrFinal)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(U|Ua|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
    pFinal
    {
        $p;
        relTol          0;
    }

    Usup
    {
	solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
    Phi
    {
        $p;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell 0;
    pRefValue 0;
}

PIMPLE
{
    nNonOrthogonalCorrectors 1;
    momentumPredictor yes;
    nCorrectors 3; //25??//3// dont modify
    //consistent   true;
    correctPhi        yes;// ok
    nOuterCorrectors  3; //3
    residualControl
    {
        U
        {
                tolerance  1e-4;// 1e-4
                relTol      0;
        }
        p
        {
                tolerance  5e-4;//5e-4
                relTol      0;
        }
     }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}


relaxationFactors
{
    p 0.3; //?
    U 0.7; //?    

    fields
    {
        "(p|pa)"        0.3;
        alpha           0.1;
        pFinal          1;
    }
    equations
    {
        "(U|Ua)"        0.7;
        "(k|epsilon)"   0.7;
    }
}


// ************************************************************************* //
